Revit 2026 API

# PartUtilsArePartsValidForMerge Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool ArePartsValidForMerge(
	Document document,
	ICollection<ElementId> partIds
)
```
```vb
Public Shared Function ArePartsValidForMerge (
	document As Document,
	partIds As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool ArePartsValidForMerge(
	Document^ document,
	ICollection<ElementId^>^ partIds
)
```
```fsharp
static member ArePartsValidForMerge :
        document : Document *
        partIds : ICollection<ElementId> -> bool
```

#### Parameters

document Document

partIds ICollectionElementId

#### Return Value

Boolean

#### Reference

PartUtils Class

Autodesk.Revit.DB Namespace